name: "rt-detr_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "input_ids"
    data_type: TYPE_FP32
    dims: [1, 3, 640, 640 ]  # Image dimensions
  }
]

output [
  {
    name: "boxes"
    data_type: TYPE_FP32
    dims: [ 100, 4 ]  # Bounding boxes
  },
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [ 100 ]  # Confidence scores
  },
  {
    name: "labels"
    data_type: TYPE_INT64
    dims: [ 100 ]  # Class labels
  }
]
